_posts/2015-06-07-a-simple-web-app-in-rust-pt-2b.org
---
layout: post
title: A Simple Web App in Rust, Part 2b
---


* The Series

This is a post in a series of me writing down my experience as I try to
build a simple web app in Rust.

So far, we have:

1. [[http://joelmccracken.github.io/entries/a-simple-web-app-in-rust-pt-1/][Defined the goal & Written a "Hello World" web server]]
2. [[http://joelmccracken.github.io/entries/a-simple-web-app-in-rust-pt-2a/][Figured out how to write to a file]]

The last part was especially harrowing. This piece will be to
investigate date/time formatting in Rust, with a focus on writing
visiting time in a nice format.

* Using Chrono

So, searching for "date" on crates.io shows
[[https://crates.io/search?q=date][one prominent result]],
namely the crate "chrono". This looks very popular, and was updated
very recently, so it looks like a good candidate. A look through the
README seems to show that it has decent date/time pretty printing functionality.

The first thing would be to add the Chrono requirement line to
~Cargo.toml~, but first let's move the old ~main.rs~ out of the way so
that there is a new place to experiment:


#+BEGIN_SRC
$ ls
Cargo.lock Cargo.toml log.txt    src        target
$ cd src/
$ ls
main.rs     web_main.rs
$ git mv main.rs main_file_writing.rs
$ touch main.rs
$ git add main.rs
$ git status
On branch master
Your branch is up-to-date with 'origin/master'.
Changes to be committed:
  (use "git reset HEAD <file>..." to unstage)

        modified:   main.rs
        copied:     main.rs -> main_file_writing.rs

Untracked files:
  (use "git add <file>..." to include in what will be committed)

        ../log.txt

$ git commit -m 'move file writing out of the way for working with dates'
[master 4cd2b0e] move file writing out of the way for working with dates
 2 files changed, 16 deletions(-)
 rewrite src/main.rs (100%)
 copy src/{main.rs => main_file_writing.rs} (100%)
#+END_SRC

Adding the dependency on Chrono to ~Cargo.toml~:

#+BEGIN_SRC
[package]
name = "simple-log"
version = "0.1.0"
authors = ["Joel McCracken <mccracken.joel@gmail.com>"]

[dependencies]

chrono = "0.2"

[dependencies.nickel]

git = "https://github.com/nickel-org/nickel.rs.git"
#+END_SRC


The readme says this next:

#+BEGIN_SRC

And put this in your crate root:

    extern crate chrono;

#+END_SRC

I don't know what this means, but I'm just going to try to put it on
top of ~main.rs~ because it looks like Rust code:

#+BEGIN_SRC
extern crate chrono;

fn main() { }

#+END_SRC

compiling:

#+BEGIN_SRC
$ cargo run
    Updating registry `https://github.com/rust-lang/crates.io-index`
 Downloading num v0.1.25
 Downloading rand v0.3.8
 Downloading chrono v0.2.14
   Compiling rand v0.3.8
   Compiling num v0.1.25
   Compiling chrono v0.2.14
   Compiling simple-log v0.1.0 (file:///Users/joel/Projects/simple-log)
     Running `/Users/joel/Projects/simple-log/target/debug/simple-log`
#+END_SRC

So, it looks like it downloaded Chrono, compiled successfully, and
exited. Rad. I think the next step would be to try to use it. Based
upon the first example listed, I have this:

#+BEGIN_SRC
extern crate chrono;
use chrono::*;

fn main() {
    let local: DateTime<Local> = Local::now();
    println!('{}', local);
}

#+END_SRC

=>

#+BEGIN_SRC
$ cargo run
   Compiling simple-log v0.1.0 (file:///Users/joel/Projects/simple-log)
main.rs:6:14: 6:16 error: unterminated character constant: '{
main.rs:6     println!('{}', local);
                       ^~
Could not compile `simple-log`.

To learn more, run the command again with --verbose.

#+END_SRC

...? After I look at this for a second, I think its telling me that I
need to use double quotes, not single quotes. which makes some sense,
since single quotes are used in lifetime specifications.

After switching from single to double quotes:

#+BEGIN_SRC
$ cargo run
   Compiling simple-log v0.1.0 (file:///Users/joel/Projects/simple-log)
     Running `/Users/joel/Projects/simple-log/target/debug/simple-log`
2015-06-05 16:54:47.483088 -04:00
#+END_SRC

... /whoa/. That was easy. It looks like ~println!~ has some kind of
interface for whatever is being printed and can print many different
things.

There is some irony here. So far, I was able to generate a simple
hello world web application and print a well-formatted date and time
with really very little effort, but writing to a file cost me dearly
in time. I'm not sure what the lesson is, here. I think it is clear
that the rust community has gone through great effort to make their
packages nice to work with, even if the language is still hard to use
(for me).

