entries/a-simple-web-app-in-rust-pt-2b/index.html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <title>A Simple Web App in Rust, Part 2b</title>
    <meta name="viewport" content="width=device-width">
    <meta name="description" content="My personal place to write about the things I find interesting. Programming, Lisp, Ruby, Emacs, etc.">
    <link rel="canonical" href="http://joelmccracken.github.io/entries/a-simple-web-app-in-rust-pt-2b/">

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/css/main.css">

</head>

    <body>

    <header class="site-header">

  <div class="wrap">

    <a class="site-title" href="/">Joel's Journal</a>

    <nav class="site-nav">
      <a href="#" class="menu-icon">
        <svg version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
           viewBox="0 0 18 15" enable-background="new 0 0 18 15" xml:space="preserve">
          <path fill="#505050" d="M18,1.484c0,0.82-0.665,1.484-1.484,1.484H1.484C0.665,2.969,0,2.304,0,1.484l0,0C0,0.665,0.665,0,1.484,0
            h15.031C17.335,0,18,0.665,18,1.484L18,1.484z"/>
          <path fill="#505050" d="M18,7.516C18,8.335,17.335,9,16.516,9H1.484C0.665,9,0,8.335,0,7.516l0,0c0-0.82,0.665-1.484,1.484-1.484
            h15.031C17.335,6.031,18,6.696,18,7.516L18,7.516z"/>
          <path fill="#505050" d="M18,13.516C18,14.335,17.335,15,16.516,15H1.484C0.665,15,0,14.335,0,13.516l0,0
            c0-0.82,0.665-1.484,1.484-1.484h15.031C17.335,12.031,18,12.696,18,13.516L18,13.516z"/>
        </svg>
      </a>
      <div class="trigger">
        <a class="page-link" href="/about">About</a>
        <a class="page-link" href="/projects">Projects</a>
      </div>
    </nav>

  </div>

</header>

    <div class="page-content">
      <div class="wrap">
      <div class="post">

  <header class="post-header">
    <h1>A Simple Web App in Rust, Part 2b</h1>
    <p class="meta">Jun 7, 2015</p>
  </header>

  <article class="post-content">
  <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. The Series</a></li>
<li><a href="#sec-2">2. Using Chrono</a></li>
<li><a href="#sec-3">3. Writing the Date/Time to a File</a></li>
<li><a href="#sec-4">4. Building a File Logger</a>
<ul>
<li><a href="#sec-4-1">4.1. Misunderstanding <code>u8</code></a></li>
<li><a href="#sec-4-2">4.2. Filling in Missing Pieces</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Conclusion &amp; Next Steps</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> The Series</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a post in a series of me writing down my experience as I try to
build a simple web app in Rust.
</p>

<p>
So far, we have:
</p>

<ol class="org-ol">
<li><a href="http://joelmccracken.github.io/entries/a-simple-web-app-in-rust-pt-1/">Defined the goal &amp; Written a "Hello World" web server</a>
</li>
<li><a href="http://joelmccracken.github.io/entries/a-simple-web-app-in-rust-pt-2a/">Figured out how to write to a file</a>
</li>
</ol>

<p>
The last part was especially harrowing. This piece will be to
investigate date/time formatting in Rust, with a focus on writing
visiting time in a nice format.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Using Chrono</h2>
<div class="outline-text-2" id="text-2">
<p>
So, searching for "date" on crates.io shows
<a href="https://crates.io/search?q=date">one prominent result</a>,
namely the crate "chrono". This looks very popular, and was updated
very recently, so it looks like a good candidate. A look through the
README seems to show that it has decent date/time pretty printing functionality.
</p>

<p>
The first thing would be to add the Chrono requirement line to
<code>Cargo.toml</code>, but first let's move the old <code>main.rs</code> out of the way so
that there is a new place to experiment:
</p>


<pre class="example">
$ ls
Cargo.lock Cargo.toml log.txt    src        target
$ cd src/
$ ls
main.rs     web_main.rs
$ git mv main.rs main_file_writing.rs
$ touch main.rs
$ git add main.rs
$ git status
On branch master
Your branch is up-to-date with 'origin/master'.
Changes to be committed:
  (use "git reset HEAD &lt;file&gt;..." to unstage)

        modified:   main.rs
        copied:     main.rs -&gt; main_file_writing.rs

Untracked files:
  (use "git add &lt;file&gt;..." to include in what will be committed)

        ../log.txt

$ git commit -m 'move file writing out of the way for working with dates'
[master 4cd2b0e] move file writing out of the way for working with dates
 2 files changed, 16 deletions(-)
 rewrite src/main.rs (100%)
 copy src/{main.rs =&gt; main_file_writing.rs} (100%)
</pre>

<p>
Adding the dependency on Chrono to <code>Cargo.toml</code>:
</p>

<pre class="example">
[package]
name = "simple-log"
version = "0.1.0"
authors = ["Joel McCracken &lt;mccracken.joel@gmail.com&gt;"]

[dependencies]

chrono = "0.2"

[dependencies.nickel]

git = "https://github.com/nickel-org/nickel.rs.git"
</pre>


<p>
The readme says this next:
</p>

<pre class="example">
And put this in your crate root:

    extern crate chrono;
</pre>

<p>
I don't know what this means, but I'm just going to try to put it on
top of <code>main.rs</code> because it looks like Rust code:
</p>

<pre class="example">
extern crate chrono;

fn main() { }
</pre>

<p>
compiling:
</p>

<pre class="example">
$ cargo run
    Updating registry `https://github.com/rust-lang/crates.io-index`
 Downloading num v0.1.25
 Downloading rand v0.3.8
 Downloading chrono v0.2.14
   Compiling rand v0.3.8
   Compiling num v0.1.25
   Compiling chrono v0.2.14
   Compiling simple-log v0.1.0 (file:///Users/joel/Projects/simple-log)
     Running `/Users/joel/Projects/simple-log/target/debug/simple-log`
</pre>

<p>
So, it looks like it downloaded Chrono, compiled successfully, and
exited. Rad. I think the next step would be to try to use it. Based
upon the first example listed, I have this:
</p>

<pre class="example">
extern crate chrono;
use chrono::*;

fn main() {
    let local: DateTime&lt;Local&gt; = Local::now();
    println!('{}', local);
}
</pre>

<p>
=&gt;
</p>

<pre class="example">
$ cargo run
   Compiling simple-log v0.1.0 (file:///Users/joel/Projects/simple-log)
main.rs:6:14: 6:16 error: unterminated character constant: '{
main.rs:6     println!('{}', local);
                       ^~
Could not compile `simple-log`.

To learn more, run the command again with --verbose.
</pre>

<p>
&#x2026;? After I look at this for a second, I think its telling me that I
need to use double quotes, not single quotes. which makes some sense,
since single quotes are used in lifetime specifications.
</p>

<p>
After switching from single to double quotes:
</p>

<pre class="example">
$ cargo run
   Compiling simple-log v0.1.0 (file:///Users/joel/Projects/simple-log)
     Running `/Users/joel/Projects/simple-log/target/debug/simple-log`
2015-06-05 16:54:47.483088 -04:00
</pre>

<p>
&#x2026; <i>whoa</i>. That was easy. It looks like <code>println!</code> has some kind of
interface for whatever is being printed and can print many different
things.
</p>

<p>
There is some irony here. So far, I was able to generate a simple
hello world web application and print a well-formatted date and time
with really very little effort, but writing to a file cost me dearly
in time. I'm not sure what the lesson is, here. I think it is clear
that the rust community has gone through great effort to make their
packages nice to work with, even if the language is still hard to use
(for me).
</p>
</div>
</div>
