_posts/2015-06-07-a-simple-web-app-in-rust-pt-2b.org
* Writing the Date/Time to a File

I think the next sensible task would be to actually write this string
to a file, and for this, I want to look at what I ended up with in the
last entry:

#+BEGIN_SRC
$ cat main_file_writing.rs
use std::io::prelude::*;
use std::fs::File;
use std::io;

fn log_something(filename: &'static str, string: &'static [u8; 12]) -> io::Result<()> {
    let mut f = try!(File::create(filename));
    try!(f.write_all(string));
    Ok(())
}

fn main() {
    match log_something("log.txt", b"ITS ALIVE!!!") {
        Ok(..) => println!("File created!"),
        Err(..) => println!("Error: could not create file.")
    }
}
#+END_SRC

I'll just do a real quick merge of the above example with this one:

#+BEGIN_SRC
extern crate chrono;

use std::io::prelude::*;
use std::fs::File;
use std::io;
use chrono::*;

fn log_something(filename: &'static str, string: &'static [u8; 12]) -> io::Result<()> {
    let mut f = try!(File::create(filename));
    try!(f.write_all(string));
    Ok(())
}

fn main() {
    let local: DateTime<Local> = Local::now();
    println!('{}', local);
    match log_something("log.txt", b"ITS ALIVE!!!") {
        Ok(..) => println!("File created!"),
        Err(..) => println!("Error: could not create file.")
    }
}
#+END_SRC

compiling:

#+BEGIN_SRC
$ ls
Cargo.lock      Cargo.toml      log.txt         src             target
$ pwd
/Users/joel/Projects/simple-log
$ ls
Cargo.lock      Cargo.toml      log.txt         src             target
$ rm log.txt
$ cargo run
   Compiling simple-log v0.1.0 (file:///Users/joel/Projects/simple-log)
     Running `target/debug/simple-log`
2015-06-05 17:08:57.814176 -04:00
File created!
$ cat log.txt
ITS ALIVE!!!$
#+END_SRC

That all worked! It feels really good to go from struggling with a
language, to being able to put things together with much less
frustration.

* Building a File Logger

We're getting closer to writing a real, bona fide piece of the final
system. It hits me that I might like to write some tests for this
code, but I'll add those in later.


Here's what this function should do:

1. Given a file name,
3. Create it first if doesn't exist, and open the file.
2. Create a time/date string,
4. Write that string to the file, and close the file.


