entries/a-simple-web-app-in-rust-pt-2b/index.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Writing the Date/Time to a File</h2>
<div class="outline-text-2" id="text-3">
<p>
I think the next sensible task would be to actually write this string
to a file, and for this, I want to look at what I ended up with in the
last entry:
</p>

<pre class="example">
$ cat main_file_writing.rs
use std::io::prelude::*;
use std::fs::File;
use std::io;

fn log_something(filename: &amp;'static str, string: &amp;'static [u8; 12]) -&gt; io::Result&lt;()&gt; {
    let mut f = try!(File::create(filename));
    try!(f.write_all(string));
    Ok(())
}

fn main() {
    match log_something("log.txt", b"ITS ALIVE!!!") {
        Ok(..) =&gt; println!("File created!"),
        Err(..) =&gt; println!("Error: could not create file.")
    }
}
</pre>

<p>
I'll just do a real quick merge of the above example with this one:
</p>

<pre class="example">
extern crate chrono;

use std::io::prelude::*;
use std::fs::File;
use std::io;
use chrono::*;

fn log_something(filename: &amp;'static str, string: &amp;'static [u8; 12]) -&gt; io::Result&lt;()&gt; {
    let mut f = try!(File::create(filename));
    try!(f.write_all(string));
    Ok(())
}

fn main() {
    let local: DateTime&lt;Local&gt; = Local::now();
    println!('{}', local);
    match log_something("log.txt", b"ITS ALIVE!!!") {
        Ok(..) =&gt; println!("File created!"),
        Err(..) =&gt; println!("Error: could not create file.")
    }
}
</pre>

<p>
compiling:
</p>

<pre class="example">
$ ls
Cargo.lock      Cargo.toml      log.txt         src             target
$ pwd
/Users/joel/Projects/simple-log
$ ls
Cargo.lock      Cargo.toml      log.txt         src             target
$ rm log.txt
$ cargo run
   Compiling simple-log v0.1.0 (file:///Users/joel/Projects/simple-log)
     Running `target/debug/simple-log`
2015-06-05 17:08:57.814176 -04:00
File created!
$ cat log.txt
ITS ALIVE!!!$
</pre>

<p>
That all worked! It feels really good to go from struggling with a
language, to being able to put things together with much less
frustration.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Building a File Logger</h2>
<div class="outline-text-2" id="text-4">
<p>
We're getting closer to writing a real, bona fide piece of the final
system. It hits me that I might like to write some tests for this
code, but I'll add those in later.
</p>


<p>
Here's what this function should do:
</p>

<ol class="org-ol">
<li>Given a file name,
</li>
<li>Create it first if doesn't exist, and open the file.
</li>
<li>Create a time/date string,
</li>
<li>Write that string to the file, and close the file.
</li>
</ol>
</div>
