entries/a-simple-web-app-in-rust-pt-2b/index.html


<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Misunderstanding <code>u8</code></h3>
<div class="outline-text-3" id="text-4-1">
<p>
My first attempt:
</p>

<pre class="example">
extern crate chrono;

use std::io::prelude::*;
use std::fs::File;
use std::io;
use chrono::*;

fn log_time(filename: &amp;'static str) -&gt; io::Result&lt;()&gt; {

    let local: DateTime&lt;Local&gt; = Local::now();
    let time_str = local.format("%Y").to_string();
    let mut f = try!(File::create(filename));
    try!(f.write_all(time_str));
    Ok(())
}

fn main() {
    match log_time("log.txt") {
        Ok(..) =&gt; println!("File created!"),
        Err(..) =&gt; println!("Error: could not create file.")
    }
}
</pre>

<p>
=&gt;
</p>

<pre class="example">
$ cargo run
   Compiling simple-log v0.1.0 (file:///Users/joel/Projects/simple-log)
src/main.rs:13:22: 13:30 error: mismatched types:
 expected `&amp;[u8]`,
    found `collections::string::String`
(expected &amp;-ptr,
    found struct `collections::string::String`) [E0308]
src/main.rs:13     try!(f.write_all(time_str));
                                    ^~~~~~~~
&lt;std macros&gt;:1:1: 6:48 note: in expansion of try!
src/main.rs:13:5: 13:33 note: expansion site
error: aborting due to previous error
Could not compile `simple-log`.

To learn more, run the command again with --verbose.
</pre>

<p>
Ugh. So, I know that there are many types of strings in
Rust<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>, and it
looks like I need a different one, here. Thing is, I don't know how to
do this, so I'll have to do some searching.
</p>

<p>
I remember seeing <a href="http://doc.rust-lang.org/book/strings.html">a section in the Rust</a> book specifically about
strings. Looking into it, it says that a can be converted from
<code>String</code> to <code>&amp;str</code> with an ampersand (<code>&amp;</code>). I don't think this is
quite right, because it looks like it's expecting a <code>[u8]</code> and <i>not</i>
a <code>&amp;str</code> <sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup> Lemmie try that:
</p>

<pre class="example">
extern crate chrono;

use std::io::prelude::*;
use std::fs::File;
use std::io;
use chrono::*;

fn log_time(filename: &amp;'static str) -&gt; io::Result&lt;()&gt; {

    let local: DateTime&lt;Local&gt; = Local::now();
    let time_str = local.format("%Y").to_string();
    let mut f = try!(File::create(filename));
    try!(f.write_all(&amp;time_str));
    Ok(())
}

fn main() {
    match log_time("log.txt") {
        Ok(..) =&gt; println!("File created!"),
        Err(..) =&gt; println!("Error: could not create file.")
    }
}
</pre>

<p>
=&gt;
</p>
<pre class="example">
$ cargo run
   Compiling simple-log v0.1.0 (file:///Users/joel/Projects/simple-log)
src/main.rs:13:22: 13:31 error: mismatched types:
 expected `&amp;[u8]`,
    found `&amp;collections::string::String`
(expected slice,
    found struct `collections::string::String`) [E0308]
src/main.rs:13     try!(f.write_all(&amp;time_str));
                                    ^~~~~~~~~
&lt;std macros&gt;:1:1: 6:48 note: in expansion of try!
src/main.rs:13:5: 13:34 note: expansion site
error: aborting due to previous error
Could not compile `simple-log`.

To learn more, run the command again with --verbose.
</pre>


<p>
Well. Apparently, adding the ampersand just converted a <code>String</code> to an
<code>&amp;String</code>. That seems to directly contradict what the Rust book is
saying, but I also probably don't know what is going on.
</p>

<p>
&#x2026;And I just reached the end of the chapter on strings. Harumph. As
far as I can tell, there isn't anything in here.
</p>

<p>
I walked away from this for a while (because, you know, life), and
while I was gone it hit me. All this time, I have been reading <code>u8</code> as
a short form of <code>UTF-8</code>, but now that I think about it, it almost
certainly actually means "unsigned 8-bit integer". And, I remember
seeing an <code>as_bytes</code> method, so let me try that instead:
</p>

<pre class="example">
extern crate chrono;

use std::io::prelude::*;
use std::fs::File;
use std::io;
use chrono::*;

fn log_time(filename: &amp;'static str) -&gt; io::Result&lt;()&gt; {
    let local: DateTime&lt;Local&gt; = Local::now();
    let bytes = local.format("%Y").to_string().as_bytes();
    let mut f = try!(File::create(filename));
    try!(f.write_all(bytes));
    Ok(())
}

fn main() {
    match log_time("log.txt") {
        Ok(..) =&gt; println!("File created!"),
        Err(..) =&gt; println!("Error: could not create file.")
    }
}
</pre>

<p>
=&gt;
</p>

<pre class="example">
$ cargo run
   Compiling simple-log v0.1.0 (file:///Users/joel/Projects/simple-log)
main.rs:10:17: 10:47 error: borrowed value does not live long enough
main.rs:10     let bytes = local.format("%Y").to_string().as_bytes();
                           ^~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
main.rs:10:59: 14:2 note: reference must be valid for the block suffix following statement 1 at 10:
58...
main.rs:10     let bytes = local.format("%Y").to_string().as_bytes();
main.rs:11     let mut f = try!(File::create(filename));
main.rs:12     try!(f.write_all(bytes));
main.rs:13     Ok(())
main.rs:14 }
main.rs:10:5: 10:59 note: ...but borrowed value is only valid for the statement at 10:4
main.rs:10     let bytes = local.format("%Y").to_string().as_bytes();
               ^~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
main.rs:10:5: 10:59 help: consider using a `let` binding to increase its lifetime
main.rs:10     let bytes = local.format("%Y").to_string().as_bytes();
               ^~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
error: aborting due to previous error
Could not compile `simple-log`.

To learn more, run the command again with --verbose.
</pre>

<p>
Well, I <i>hope</i> this is progress. Does this error mean I fixed
something, and there was something else wrong that was obscuring this
problem? Did I introduce a whole new problem?
</p>

<p>
The strange thing about this error message is that it seems to be
talking about error messages on the same line. I don't really
understand most of it, but I'm thinking it is saying that I need to
add a let in the middle of the sequence of method calls. Lets try:
</p>

<pre class="example">
fn log_time(filename: &amp;'static str) -&gt; io::Result&lt;()&gt; {
    let local: DateTime&lt;Local&gt; = Local::now();
    let formatted = local.format("%Y").to_string();
    let bytes = formatted.as_bytes();
    let mut f = try!(File::create(filename));
    try!(f.write_all(bytes));
    Ok(())
}
</pre>

<p>
=&gt;
</p>

<pre class="example">
$ cargo run
   Compiling simple-log v0.1.0 (file:///Users/joel/Projects/simple-log)
     Running `target/debug/simple-log`
File created!
$ cat log.txt
2015$
</pre>

<p>
Great! All the pieces are here. Before I move on, I want to reflect
that I find this a little disappointing. It seems like Rust should be
able to infer the correct behavior in the previous snippet without my
guidance.
</p>

<p>
Testing the script:
</p>

<pre class="example">
$ ls
Cargo.lock      Cargo.toml      log.txt         src             target
$ rm log.txt
$ cargo run
     Running `target/debug/simple-log`
File created!
$ cat log.txt
2015$ cargo run
     Running `target/debug/simple-log`
File created!
$ cat log.txt
2015$
</pre>
</div>
</div>
